Revit 2026 API

# SelectionFilterElementRemoveSingle Method

---

Removes a single ElementId from the filter's set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSingle(
	ElementId id
)
```
```vb
Public Sub RemoveSingle (
	id As ElementId
)
```
```cpp
public:
void RemoveSingle(
	ElementId^ id
)
```
```fsharp
member RemoveSingle :
        id : ElementId -> unit
```

#### Parameters

id ElementId
     The ElementId to remove.

| Exception | Condition |
| --- | --- |
| ArgumentException | Invalid ElementId |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SelectionFilterElement Class

Autodesk.Revit.DB Namespace